atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
    esp_netif_t *sta_wifi_interface = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    esp_netif_t *ap_wifi_interface = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");

    // Disconnect STA if connected to access point
    if ((sta_wifi_interface != NULL) && (esp_netif_is_netif_up(sta_wifi_interface))) {
        esp_err_t err = esp_wifi_disconnect();
        if (UNLIKELY(err == ESP_FAIL)) {
            ESP_LOGE(TAG, "ESP FAIL error while disconnecting from AP, continuing network shutdown...");
        }
    }

    // Stop and deinit the WiFi driver, these only return OK, or not init error (fine to ignore).
    esp_wifi_stop();
    esp_wifi_deinit();

    // Stop sntp (ignore OK, or not configured error)
    esp_sntp_stop();

    // Destroy existing netif interfaces
    if (ap_wifi_interface != NULL) {
        esp_netif_destroy_default_wifi(ap_wifi_interface);
    }
    if (sta_wifi_interface != NULL) {
        esp_netif_destroy_default_wifi(sta_wifi_interface);
    }
}

static void get_sta_rssi(Context *ctx, term pid, term ref)
{
    size_t tuple_reply_size = PORT_REPLY_SIZE + TUPLE_SIZE(2);

    int sta_rssi = 0;
    wifi_ap_record_t ap_info;
    esp_err_t status = esp_wifi_sta_get_ap_info(&ap_info);
    if (status == ESP_OK) {
        esp_err_t err = esp_wifi_sta_get_rssi(&sta_rssi);
        if (UNLIKELY(err != ESP_OK)) {
            term error_term = term_from_int(err);
            ESP_LOGE(TAG, "error obtaining RSSI: [%i] %u", err, error_term);
            // Reply: {Ref, {error, Reason}}
            port_ensure_available(ctx, tuple_reply_size);
            term error = port_create_error_tuple(ctx, error_term);
            port_send_reply(ctx, pid, ref, error);
            return;
        }
    } else {
        ESP_LOGE(TAG, "Device is not connected to any AP.");
        // Reply: {Ref, {error, network_down}}
        port_ensure_available(ctx, tuple_reply_size);
        term error = port_create_error_tuple(ctx, globalcontext_existing_term_from_atom_string(ctx->global, ATOM_STR("\x0C", "network_down")));
        port_send_reply(ctx, pid, ref, error);
        return;
    }
    term rssi = term_from_int(sta_rssi);
    int rssi_atom = globalcontext_existing_term_from_atom_string(ctx->global, ATOM_STR("\x4", "rssi"));
    // {Ref, {rssi, -25}}
    port_ensure_available(ctx, tuple_reply_size);
    term reply = port_create_tuple2(ctx, rssi_atom, rssi);
    port_send_reply(ctx, pid, ref, reply);
}

static NativeHandlerResult consume_mailbox(Context *ctx)
{
    bool cmd_terminate = false;
    Message *message = mailbox_first(&ctx->mailbox);
    term msg = message->message;

    if (UNLIKELY(!term_is_tuple(msg) || term_get_tuple_arity(msg) != 3)) {
        ESP_LOGW(TAG, "Invalid message.  Ignoring.");
        return NativeContinue;
    }

    //TODO: port this code to standard port (and gen_message)
    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);
    term cmd = term_get_tuple_element(msg, 2);
    term cmd_term = term_invalid_term();
    term config = term_invalid_term();

    if ((term_is_tuple(cmd) && term_get_tuple_arity(cmd) == 2) || term_is_atom(cmd)) {

        if (term_is_atom(cmd)) {
            cmd_term = cmd;
        } else {
            cmd_term = term_get_tuple_element(cmd, 0);
            config = term_get_tuple_element(cmd, 1);
        }

        enum network_cmd cmd = interop_atom_term_select_int(cmd_table, cmd_term, ctx->global);
        switch (cmd) {
            case NetworkStartCmd:
                start_network(ctx, pid, ref, config);
                break;
            case NetworkRssiCmd:
                get_sta_rssi(ctx, pid, ref);
                break;
            case NetworkStopCmd:
                cmd_terminate = true;
                stop_network(ctx);
                break;

            default: {
                ESP_LOGE(TAG, "Unrecognized command: %x", cmd);
                // {Ref, {error, badarg}}
                size_t heap_size = TUPLE_SIZE(2) + REF_SIZE + TUPLE_SIZE(2);
                if (UNLIKELY(memory_ensure_free(ctx, heap_size) != MEMORY_GC_OK)) {
                    ESP_LOGE(TAG, "Unable to allocate heap space for error; no message sent");
                    return NativeContinue;
                }
                port_send_reply(ctx, pid, ref, port_create_error_tuple(ctx, BADARG_ATOM));
            }
        }
    } else {
        // {Ref, {error, badarg}}
        size_t heap_size = TUPLE_SIZE(2) + REF_SIZE + TUPLE_SIZE(2);
        if (UNLIKELY(memory_ensure_free(ctx, heap_size) != MEMORY_GC_OK)) {
            ESP_LOGE(TAG, "Unable to allocate heap space for error; no message sent");
            return NativeContinue;
        }
        port_send_reply(ctx, pid, ref, port_create_error_tuple(ctx, BADARG_ATOM));
    }

    // TODO: handle close with new API

    mailbox_remove_message(&ctx->mailbox, &ctx->heap);

    return cmd_terminate ? NativeTerminate : NativeContinue;
}

//
// Entrypoints
//

void network_driver_init(GlobalContext *global)
{
    esp_err_t err;

    if ((err = esp_netif_init()) != ESP_OK) {
        ESP_LOGE(TAG, "Failed to initialize network interface %d", err);
        AVM_ABORT();
    } else {
        ESP_LOGI(TAG, "Initialized network interface");
    }
    err = esp_event_loop_create_default();
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        ESP_LOGE(TAG, "Failed to create default event loop (err=%d)", err);
        AVM_ABORT();
    } else {
        ESP_LOGI(TAG, "Created default event loop");
    }
}

Context *network_driver_create_port(GlobalContext *global, term opts)
{
    UNUSED(opts);

    Context *ctx = context_new(global);
    ctx->native_handler = consume_mailbox;
    ctx->platform_data = NULL;
    return ctx;
}

REGISTER_PORT_DRIVER(network, network_driver_init, NULL, network_driver_create_port)

#endif
